publish/career/canonical.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-26 Sun 13:52 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="ahnaf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/css/resume.css" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css?family=Open+Sans">
</head>
<body>
<div id="content" class="content">
<p>
26 January 2025
</p>

<p>
The questions in the list are geared towards a very specific set of answers. I
have answered them below, but I would like to provide a bit of context. I am
from a developing country who studied in a not-so preferable environment.
</p>

<p>
I was grateful enough to visit Singapore for my Undergraduate where I started
learning Computer Science. Since then, there has not been a single week where
I have not learned something new. 
</p>

<div id="outline-container-orgecd46a1" class="outline-2">
<h2 id="orgecd46a1">Education</h2>
<div class="outline-text-2" id="text-orgecd46a1">
<ol class="org-ol">
<li><p>
In high school, how did you fare in mathematics and physical sciences?
Which were your strongest subjects in the hard sciences, and how did you
rank in your class?
</p>

<p>
For both sciences and mathematics, I have achieved straight As in both my
GCE O and A Levels. I was fairly strong in both general and pure
mathemetics. For physical sciences, physics was my strongest subject, and
chemistry my weakest.
</p></li>

<li><p>
In high school, what leadership roles did you take on?
</p>

<p>
I did not have the opportunity to participate in any additional curricular
activities in high school
</p></li>

<li><p>
What courses and university did you choose, and why?
</p>

<p>
I chose to Study in Singapore. I was not initially keen on choosing
Computer Science but intro courses in the First semester motivated me to
choose. Finally, I ended up Majoring in Security.
</p></li>

<li><p>
How did you rank competitively in university? Which were your strongest
courses, and which did you enjoy the most?
</p>

<p>
Singapore is competitive. I performed best on Security courses with Machine
Learning and Artificial Intelligence being my weakest. I did and still
enjoy learning about Security related materials.
</p></li>

<li><p>
In high school and at university, describe your achievements that were
considered exceptional by colleagues and staff.
</p>

<p>
Other than the grades that I achieved, I have no significant achievements
from high school. I just did not have the opportunity to do so, primarily
because of financial and cultural reasons.
</p>

<p>
In University things were different. 
</p>

<p>
I have been involved in the following:
</p>

<ul class="org-ul">
<li>Photographic Committee Member</li>
<li>Billiards Member</li>
<li>Table Tennis Member</li>
</ul>

<p>
And, I have achieved the following:
</p>

<ul class="org-ul">
<li>Apex Business Challenge 2016 Finalist</li>
<li>City Security Award</li>
<li>Graduating while still funding my own living cost. 
<ul class="org-ul">
<li>Although this is not a graded achievement, it instilled in me the
ability to schedule and prioritize task</li>
</ul></li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-org7aefcfc" class="outline-2">
<h2 id="org7aefcfc">Career development</h2>
<div class="outline-text-2" id="text-org7aefcfc">
<ol class="org-ol">
<li><p>
How would you describe your level of experience as a professional software
engineer?
</p>

<p>
I am a problem solver. I started as a Developer with only experience in
Python. I have learned new tech, language and skills as the situation in my
current company necessitated, that includes: C, CPP, Docker, Swarm, and
currently, Kubernetes.
</p>

<p>
I am responsible for Server Administration including both on Prem and Off
Prem Servers.
</p></li>

<li><p>
Describe your skill in your preferred development language, and how you
attained it.
</p>

<p>
I don't quite have a language I love, however, i would use python as it is
fast for prototyping which gets things running. Although every language has
it's own advantages, I focus more on the more standard programming
toolkits: Testing, SOLID, DRY. 
</p></li>

<li><p>
What are your strengths as a software engineer?
</p>

<p>
I am not the stronger code implementer. However, I have been designing,
architecting our companies technical product while doing Operations
work. My greatest strength would be to be flexible enough to work with
people from multiple countries, and be able to translate requirements and
still deliver work.
</p></li>

<li><p>
What experience do you have with Linux system administration? What is the
largest group of servers you have been part of operating?
</p>

<p>
I am in charge of administrating both online and offline servers in my
current company, at MicroSec. This includes primarily Ubuntu, but also,
Centos. I have also worked with RHEL. 
</p></li>

<li><p>
What experience do you have with site reliability engineering, keeping
production services online and available?
</p>

<p>
I am only maintaining a few live servers. I don't have experience on
managing hundreds of servers at scale, but that is what I want to move
towards as my next Career step. I know the toolkits that are generally
used, Terraform for example, but I have not practially done it, yet.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-org28e925a" class="outline-2">
<h2 id="org28e925a">Experience</h2>
<div class="outline-text-2" id="text-org28e925a">
<ol class="org-ol">
<li><p>
Describe your level of experience in Python, and how you have attained it.
</p>

<p>
I have been professionaly using python for the last 5 years. I have never
extended python with custom C libraries, but that should be relatively easy
enough to learn.
</p></li>

<li><p>
When did you start working on Linux? Describe your level of experience as a
user &amp; developer on Linux.
</p>

<p>
I first started using a version of Linux in my 3rd year of University, my
first Internship. I did not before than that there were other operating
systems other than Windows and Mac. Since then, I have strictly used
Ubuntu. I only ever switch to Windows for either Photography or some Games.
</p>

<p>
All development, of multiple languages and build platforms are just much
easier on Linux, aside from Apple specific tech, for example Swift.
</p></li>

<li><p>
Describe your experience with container technologies (Docker, LXD,
Kubernetes, etc)
</p>

<p>
I first used containers, LxCs during my time at University. I learned that
they were build upon the idea of changeroot. Afterwards, at my current
company, I learned docker and docker swarm. Docker is brilliant.
</p>

<p>
I only recently started learning Kubernetes. It's BIG. It's originally
based on Borg. I don't think it's quite suitable unless one has a large
infra.
</p></li>

<li><p>
How do you prefer to drive documentation for your products?
</p>

<p>
A product is usless if no one is there to use it. If there are users, they
need to know how the produt works. The audience would demand the style of
documentation, but in general, some form of documentation is absolutely
critical
</p></li>

<li><p>
How do you think about quality in your products?
</p>

<p>
Well as Steve jobs has said it. Quality should never be marketed. Users
will naturally use the product that has the most quality for it's use case
</p></li>

<li><p>
Describe a case where it was very difficult to test code you were writing,
but you found a reliable way to do it.
</p>

<p>
Writing tests for Embedded platform is the most difficult of all, as it
interfaces with hardware. I cannot say I have found the most reliable way,
as interfacing with hardware can always go wrong. 
</p>

<p>
In this cases though, I assume external hardware has a certain function and
treat them like API calls to abstract the functionality in a pure software
based approach.
</p></li>

<li><p>
If available, provide your public github/gitlab repository links
</p>

<p>
<a href="https://github.com/aporan">https://github.com/aporan</a>
</p></li>

<li><p>
What would you like to achieve in career development and skills
development?
</p>

<p>
I want to learn on how things are handled at scale, focusing on solving
DevOps and product pipeline delivery.
</p></li>
</ol>
</div>
</div>

<div id="outline-container-orgfa18e78" class="outline-2">
<h2 id="orgfa18e78">Context</h2>
<div class="outline-text-2" id="text-orgfa18e78">
<ol class="org-ol">
<li><p>
Are you involved in open source software?
</p>

<p>
Not as much as I would like.
</p></li>

<li><p>
Describe any significant contributions to open source (with links where
possible), if any
</p>

<p>
NA
</p></li>

<li><p>
What do you think are the key ingredients of a successful open source
project?
</p>

<p>
Product openness which leads to consumer trust
</p></li>

<li><p>
Why do you most want to work for Canonical?
</p>

<p>
I am interested in OS, package security, networking and kernel. All of
which Canonical is strongly involved in and at scale.
</p></li>

<li><p>
Which other companies are building the sort of products you would like to
work on?
</p>

<p>
Linux Kernel is something I definitely want to work on, but that's not a
company. 
</p></li>

<li><p>
Which companies have the most interesting approach to devops and site
reliability engineering?
</p>

<p>
As always, it depends on the type of product. For Web based software
platforms, <a href="https://www.flow.io/">https://www.flow.io/</a> has the most interesting approach. Here is
a great youtube video that captures their flow:
<a href="https://www.youtube.com/watch?v=j6ow-UemzBc">https://www.youtube.com/watch?v=j6ow-UemzBc</a>
</p></li>

<li><p>
What do you think could raise the bar for site reliability engineering,
globally?
</p>

<p>
From a work point of view, reducing the number of steps in delivery which
generally means automating things that can be automated
</p></li>

<li><p>
What do you think Canonical needs to improve in its engineering and
products?
</p>

<p>
Ubuntu has come a long way, and it's great to see so many
integrations. From canonica's own consumer product, a smooth User
experience like Apple is a long way away. 
</p>

<p>
From system administration perspective, however, and ubuntu being the entry
point for most people, a more robust secured and tested package
provisioning mechanisms.
</p></li>

<li><p>
Who do you think are key competitors to Canonical? How do you think
Canonical should plan to win that race?
</p>

<p>
I would very much like to see Games, personally. Gamers already like the
idea of customization, and Linux, in general, is about flexibility. It
would definitely provide an edge. 
</p></li>
</ol>
</div>
</div>
</div>
</body>
</html>
